//#include "stm32f10x.h" 
#include "GlobalVar.h"
#include "Define.h"

//u8     Overload_Restart_Check_Flag;  //¹ıÔØÖØÆô¼ì²â±êÖ¾Î»
//u16    DC_LVD_Disconnect_Vol;        //µÍÑ¹¶Ï¿ªµçÑ¹
//u16    DC_LVD_Warn_Vol;              //µÍÑ¹±¨¾¯µçÑ¹
//u16    DC_LVD_Restore_Vol;           //µÍÑ¹»Ö¸´µçÑ¹

//u8     Comm_ON_OFF_Inverter;       //Í¨Ñ¶¿ª¹ØÄæ±äÆ÷ÃüÁî×Ö£¬=1£º¿ª£»=2£º¹Ø
//u8     Comm_ON_Inverter_Flag;      //Í¨Ñ¶¿ªÄæ±äÆ÷×´Ì¬±êÖ¾
//u8     Comm_OFF_Inverter_Flag;     //Í¨Ñ¶¹ØÄæ±äÆ÷×´Ì¬±êÖ¾

//u8     LED1_Mode;                  //led1ÃüÁî×Ö  =0:Ãğ£»=1:ÂÌÁÁ£»=2:»ÆÁÁ£»=3:ºìÁÁ£»
//u8     LED2_Mode;                  //led2ÃüÁî×Ö  =0:Ãğ£»=1:ÂÌÁÁ£»=2:ÂÌÉÁ£»=3:»ÆÉÁ£»=4:ºìÁÁ
//u8     LED2_Time;                    

//u8     Check_Times;                //ÎÂ¶È´«¸ĞÆ÷ÊÇ·ñÕı³£ÅĞ¶Ï´ÎÊı
//u8     Temp_Sensor_Check[3][5];    //ÎÂ¶È´«¸ĞÆ÷²É¼¯Êı¾İ´æ´¢¼Ä´æÆ÷   Õâ¸öµØ·½ÓĞ´íÎó£¬Ó¦¸Ã½«5¸Ä³É6·ñÔò£¬»á³öÏÖÄÚ´æÎó²Ù×÷¡£

//u8     Judge_LVD_HVD_Temp_AC_OFF;   //Äæ±äÆ÷µÄ¶Ï¿ªÔ­Òò±íÊö¼Ä´æÆ÷ 1:StartLVD_DisconnectµÍÑ¹¶Ï¿ª£¬2:DC_Min_DisconnectµÍÑ¹¶Ï¿ª£»3:StartHVD_Disconnect¸ßÑ¹¶Ï¿ª£»4:DC_Max_Disconnect¸ßÑ¹¶Ï¿ª£»5£º¸ßÎÂ¶Ï¿ª
//u8     flash_data[60];   

//u8     com_enable;                  //´®¿ÚÍ¨ĞÅ¿ØÖÆÉè±¸Ê¹ÄÜ±äÁ¿£¬1£¬»ñµÃÊ¹ÄÜ£»0£¬Ã»ÓĞ»ñµÃÊ¹ÄÜ¡£
//u8     com_enable_count;            //´®¿ÚÍ¨ĞÅ¿ØÖÆÊ¹ÄÜÎ»²ÉÑùÂË²¨Æ÷¡£
//u8     remote_switch;               //Ô¶³Ì¿ª¹Ø»ú´¥µã¡£
//u8     remote_switch_count;         //Ô¶³Ì¿ª¹Ø»ú´¥µã²ÉÑùÂË²¨Æ÷¡£
//u8     timingfunc_enable;              //¶¨Ê±ÆôÍ£»úÄ£Ê½Ê¹ÄÜ±äÁ¿¡£
//u8     timingfunc_enable_count;        //¶¨Ê±ÆôÍ£»úÄ£Ê½Ê¹ÄÜ±äÁ¿²ÉÑùÂË²¨¡£
//u8     savingfunc_enable;              //½ÚµçÆôÍ£»úÄ£Ê½Ê¹ÄÜ±äÁ¿¡£
//u8     savingfunc_enable_count;        //½ÚµçÆäÍ£»úÄ£Ê½Ê¹ÄÜ±äÁ¿²ÉÑùÂË²¨¡£
//u8     boat_switch_1;                //´¬ĞÍ¿ª¹Ø±äÁ¿£¬1£¬´¬ĞÍ¿ª¹Ø1µµÓĞĞ§£»0£¬´¬ĞÍ¿ª¹Ø1µµÎŞĞ§¡£  ÊÖ¶¯¿ª»ú
//u8     boat_switch_2;                //´¬ĞÍ¿ª¹Ø±äÁ¿£¬1£¬´¬ĞÍ¿ª¹Ø2µµÓĞĞ§£»0£¬´¬ĞÍ¿ª¹Ø2µµÎŞĞ§¡£  Ô¶³Ì¿ª¹Ø»ú£¨°üÀ¨Í¨ĞÅ¿ª¹Ø»úºÍÔ¶³Ì´¥µã¿ª¹Ø»ú£©
//u8     boat_switch_3;                //´¬ĞÍ¿ª¹Ø±äÁ¿£¬1£¬´¬ĞÍ¿ª¹ØMµµÓĞĞ§£»0£¬´¬ĞÍ¿ª¹ØMµµÎŞĞ§¡£  ¹Ø»ú
//u8     boat_switch_count1;           //´¬ĞÍ¿ª¹Ø±äÁ¿²ÉÑùÂË²¨Æ÷¡£
//u8     boat_switch_count2;           //´¬ĞÍ¿ª¹Ø±äÁ¿²ÉÑùÂË²¨Æ÷¡£
//u8     boat_switch_count3;           //´¬ĞÍ¿ª¹Ø±äÁ¿²ÉÑùÂË²¨Æ÷¡£
//u8     overload_detection;          //¹ıÁ÷¼ì²â£¬ÓÃÓÚ¹ıÁ÷ÖØºÏÕ¢¹ı³ÌÖĞ£¬ÖØºÏÕ¢¡£
//u8     standby_off;                 //Ê¡µç´ı»úÄ£Ê½ÏÂµÄ¹Ø»úÃüÁî
////¿ª¹Ø»ú×´Ì¬»úº¯ÊıĞèÒªËø´æµÄÊÇ7¸ö±äÁ¿·Ö±ğÊÇ£º1£¬¹ÊÕÏ±êÖ¾£¬2£¬´¬ĞÍ¿ª¹Ø×´Ì¬£¨±¾µØ/¹Ø»ú/Ô¶³Ì£©£¬3£¬Ô¶³ÌÍ¨ĞÅ¿ØÖÆÊ¹ÄÜ±êÖ¾£¨Ô¶³ÌÍ¨ĞÅ/Ô¶³Ì¿ª¹Ø£©£¬4£¬Ô¶³ÌÍ¨ĞÅ¿ª¹Ø»úÖ¸Áî£¬5£¬Ô¶³Ì¿ª¹ØÖ¸Áî¿ª¹Ø»úÖ¸Áî£¬6£¬¶¨Ê±ÆôÍ£¿ª¹Ø»úÖ¸Áî£¬7£¬Ê¡µç¿ª¹Ø»úÖ¸Áî¡£
////·Ö±ğ±äÁ¿ÈçÏÂ£º1£¬device_fault;2,boatswitch_position;3,con_communication_enable; 4, on_off_communication;5 on_off_remoteswitch;6,on_off_timing;7,on_off_saving;
//u8     device_fault;                //¹ÊÕÏ±êÖ¾
//u8     boatswitch_position;         //´¬ĞÍ¿ª¹Ø×´Ì¬£¨±¾µØ/¹Ø»ú/Ô¶³Ì£©
//u8     con_communication_enable;    //Ô¶³ÌÍ¨ĞÅ¿ØÖÆÊ¹ÄÜ±êÖ¾£¨Ô¶³ÌÍ¨ĞÅ/Ô¶³Ì¿ª¹Ø£©
//u8     on_off_communication;        //Ô¶³ÌÍ¨ĞÅ¿ª¹Ø»úÖ¸Áî¡£
//u8     on_off_remoteswitch;         //Ô¶³Ì¿ª¹ØÖ¸Áî¿ª¹Ø»úÖ¸Áî¡£
//u8     on_off_timing;               //¶¨Ê±ÆôÍ£¿ª¹Ø»úÖ¸Áî¡£
//u8     on_off_saving;               //Ê¡µç¿ª¹Ø»úÖ¸Áî¡£
//u8     ac_output_enable;            //ÓÉÍâ²¿Ìõ¼ş¸ø¶¨µÄ¿ª¹Ø»úÃüÁî
//u8     LVD_OFF_Flag;                  //¼ì²éµ½Ö±Á÷µçÑ¹µÍ±êÖ¾±äÁ¿£¬0£¬Ã»ÓĞ¼ì²âµ½£»1£¬¼ì²âµ½¡£
//u16    LVD_OFF_Flag_count;            //¼ì²éµ½Ö±Á÷µçÑ¹µÍ±êÖ¾±äÁ¿ÂË²¨ĞÅºÅ
//u8     HVD_OFF_Flag;                  //¼ì²éµ½Ö±Á÷µçÑ¹¸ß±êÖ¾±äÁ¿£¬0£¬Ã»ÓĞ¼ì²âµ½£»1£¬¼ì²âµ½¡£
//u16    HVD_OFF_Flag_count;            //¼ì²éµ½Ö±Á÷µçÑ¹¸ß±êÖ¾±äÁ¿ÂË²¨ĞÅºÅ
//u8     TEMP_OFF_Flag;                 //¼ì²âµ½¸ßÎÂ±êÖ¾±äÁ¿£¬0£¬Ã»ÓĞ¼ì²âµ½£»1£¬¼ì²âµ½¡£
//u16    TEMP_OFF_Flag_count;           //¼ì²âµ½¸ßÎÂ±êÖ¾±äÁ¿ÂË²¨ĞÅºÅ
//u8     LVD_FUNC_ENABLE;               //¼ì²âµÍÑ¹¹Ø»úÓ²¼ş·§ÖµÊ¹ÄÜĞÅºÅ£¬0£¬Ã»ÓĞ¼ì²âµ½£»1£¬¼ì²âµ½¡£
//u8     LVD_FUNC_ENABLE_count;         //¼ì²âµÍÑ¹¹Ø»úÓ²¼ş·§ÖµÊ¹ÄÜÂË²¨ĞÅºÅ¡£
//u8     LVD_FUNC_VALUE;                //¼ì²âµÍÑ¹¹Ø»úÓ²¼ş·§ÖµĞÅºÅ£¬0£¬10.5v£»1£¬11.5v
//u8     LVD_FUNC_VALUE_count;          //¼ì²âµÍÑ¹¹Ø»úÓ²¼ş·§ÖµÂË²¨ĞÅºÅ¡£
//u8      on_off_and_savinglogic;
////u8      test_bit1;
////u8      test_bit2;
//u32    QITONG_MAX;                   //²âÊÔÓÃ¡£
//u32    QITONG_MAX1;                   //²âÊÔÓÃ¡£
//u32    QITONG_MAX2;                    //²âÊÔÓÃ¡£
//u32    QITONG_MAX3;                    //²âÊÔÓÃ¡£
//u8     QITONG_MAX3_COUNT;              //²âÊÔÓÃ¡£
//u32    QITONG_MAX4;                    //²âÊÔÓÃ¡£
//float  QITONG_VALUE;                   //²âÊÔÓÃ¡£
//float  QITONG_VALUE1;                   //²âÊÔÓÃ¡£
//float  QITONG_VALUE2;                   //²âÊÔÓÃ¡£
//float  QITONG_VALUE3;                   //²âÊÔÓÃ¡£
//float  QITONG_VALUE4;                   //²âÊÔÓÃ¡£
//u8     sine_P_transition_sampling;     //ÓÃÓÚ²ÉÑù½ÚÅÄÆ÷
//u8     sine_P_transition_regulation;   //ÓÃÓÚµçÑ¹µ÷½ÚµÄ½ÚÅÄÆ÷
//u32    ac_voltage_accu;                //½»Á÷µçÑ¹²ÉÑùÀÛ¼ÓÆ÷
//u32    ac_current_accu;                //½»Á÷µçÁ÷²ÉÑùÀÛ¼ÓÆ÷
//u8     ac_sampling_count;              //½»Á÷²ÉÑù´°¿Ú¼ÆÊıÆ÷



////Ö±Á÷µçÑ¹ÂË²¨Êı×é£¬DC_VOL_FILTER[20]
//u16   DC_VOL_FILTER[60];
//u8    DC_VOL_FILTER_count; 
//u32   DC_VOL_FILTER_sum;

////Ö±Á÷µçÑ¹Ç°À¡ÂË²¨Êı×é£¬DC_VOL_FFB_FILTER[20]
//u16   DC_VOL_FFB_FILTER[300];
//u16   DC_VOL_FFB_FILTER_count; 
//u16   DC_VOL_FFB_FILTER_samplecount; 
//u32   DC_VOL_FFB_FILTER_sum;
//u16   DC_VOL_FFB_VOL;
//float   DC_VOL_FFB_CONTROLVALUE;

//uc16   sine[180]=    //50ºÕ×ÈÊä³öÆµÂÊ¶ÔÓ¦µÃÕıÏÒ²¨Êı±í,50HZÊ±£¬·åÖµÎª4000.
//{
//  0,70,140,209,279,349,418,487,557,626,              
//	695,763,832,900,968,1035,1103,1169,1236,1302,      
//	1368,1433,1498,1563,1627,1690,1753,1816,1878,1939, 
//	2000,2060,2120,2179,2237,2294,2351,2407,2463,2517,
//	2571,2624,2677,2728,2779,2828,2877,2925,2973,3019,
//	3064,3109,3152,3195,3236,3277,3316,3355,3392,3429,
//	3464,3498,3532,3564,3595,3625,3654,3682,3709,3734,
//	3759,3782,3804,3825,3845,3864,3881,3897,3913,3927,
//	3939,3951,3961,3970,3978,3985,3990,3995,3998,3999,
//	4000,3999,3998,3995,3990,3985,3978,3970,3961,3951,
//	3939,3927,3913,3897,3881,3864,3845,3825,3804,3782,
//	3759,3734,3709,3682,3654,3625,3595,3564,3532,3498,
//	3464,3429,3392,3355,3316,3277,3236,3195,3152,3109,
//  3064,3019,2973,2925,2877,2828,2779,2728,2677,2624,
//	2571,2517,2463,2407,2351,2294,2237,2179,2120,2060,
//	2000,1939,1878,1816,1753,1690,1627,1563,1498,1433,
//	1368,1302,1236,1169,1103,1035,968,900,832,763,
//	695,626,557,487,418,349,279,209,140,70
//};

//uc16   sine60[200]=  
////ÁùÊ®ºÕ×ÈÊä³öÆµÂÊ¶ÔÓ¦µÄÕıÏÒ²¨Êı±í£¬60hzÊ±×î´ó·åÖµÎª4096£¬Õâ¸öÊÇ²»¶ÔµÄ£¬ÒòÎª60ºÕ×ÈµÄpwm¶¨Ê±Æ÷×î´óÖµÎª3000.ÕâÑùµÄÊı¾İ½øÈë±È½ÏÆ÷»áµ¼ÖÂ³öÏÖ²¨ĞÎÆ½¶¥»¯¼ÓÖØÈı´ÎĞ³²¨¡£
//{
////	0,64,129,193,257,321,385,449,513,577,             	 
////	640,704,767,830,893,956,1018,1080,1142,1204,      
////	1265,1326,1387,1447,1507,1567,1626,1685,1743,1801, 
////	1859,1916,1972,2028,2084,2139,2194,2248,2301,2354,
////	2405,2458,2509,2560,2610,2659,2708,2756,2803,2849,
////	2895,2940,2985,3028,3071,3113,3155,3195,3235,3274,
////	3313,3350,3387,3422,3457,3491,3525,3557,3588,3619,
////	3649,3677,3705,3732,3757,3783,3807,3831,3853,3874,
////	3896,3914,3933,3950,3967,3982,3997,4010,4023,4035,
////	4045,4055,4063,4071,4073,4083,4088,4091,4094,4095,
////	4096,4096,4094,4092,4088,4084,4078,4072,4064,4056,
////	4046,4036,4024,4012,3998,3984,3968,3952,3934,3916,
////	3897,3876,3855,3833,3810,3786,3761,3735,3708,3680,
////  3651,3622,3591,3560,3528,3495,3461,3426,3390,3354,
////	3316,3278,3239,3200,3159,3118,3076,3033,2989,2945,
////	2900,2854,2808,2760,2712,2664,2615,2565,2515,2463,
////	2412,2360,2307,2253,2199,2145,2090,2034,1978,1922,
////	1864,1807,1749,1691,1632,1573,1513,1453,1393,1332,
////	1271,1210,1148,1087,1024,962,899,837,774,710,
////	647,583,520,456,392,328,264,199,135,71
//	
//	0	,     47	,  94	,  141	,188	,235	,282	,329	,376	,423	,
//	469	,	  516	,  562	,608	,654	,700	,746	,792	,837	,882	,
//	927	,	  972	,  1016	,1060	,1104	,1148	,1191	,1235	,1277	,1320	,
//	1362	,	1404	,1445	,1486	,1527	,1567	,1607	,1647	,1686	,1725	,
//	1763	,	1801	,1839	,1876	,1912	,1948	,1984	,2019	,2054	,2088	,
//	2121	,	2154	,2187	,2219	,2250	,2281	,2312	,2341	,2370	,2399	,
//	2427	,	2454	,2481	,2507	,2533	,2558	,2582	,2606	,2629	,2651	,
//	2673	,	2694	,2714	,2734	,2753	,2772	,2789	,2806	,2823	,2838	,
//	2853	,	2867	,2881	,2894	,2906	,2917	,2928	,2938	,2947	,2955	,
//	2963	,	2970	,2976	,2982	,2987	,2991	,2994	,2997	,2999	,3000	,
//	3000	,	3000	,2999	,2997	,2994	,2991	,2987	,2982	,2976	,2970	,
//	2963	,	2955	,2947	,2938	,2928	,2917	,2906	,2894	,2881	,2867	,
//	2853	,	2838	,2823	,2806	,2789	,2772	,2753	,2734	,2714	,2694	,
//	2673	,	2651	,2629	,2606	,2582	,2558	,2533	,2507	,2481	,2454	,
//	2427	,	2399	,2370	,2341	,2312	,2281	,2250	,2219	,2187	,2154	,
//	2121	,	2088	,2054	,2019	,1984	,1948	,1912	,1876	,1839	,1801	,
//	1763	,	1725	,1686	,1647	,1607	,1567	,1527	,1486	,1445	,1404	,
//	1362	,	1320	,1277	,1235	,1191	,1148	,1104	,1060	,1016	,972	,
//	927	,	  882	,  837	,792	,746	,700	,654	,608	,562	,516	,
//	469	,   423	, 	376	,329	,282	,235	,188	,141	,94	,  47
//};

//              
//uc16   temperature_mid_pos[]=   //ÕıÎÂ¶ÈÇø¼äÎÂ¶È±í
//{//(temp<=temperature_mid_pos[i])&(temp>=temperature_mid_pos[i+1]) 
//	3138,3100,3061,3022,2981,2941,2899,2857,2814,2771,					  // 0 - 9
//	2728,2684,2639,2594,2549,2504,2458,2413,2367,2321,					  // 10~19
//	2275,2230,2184,2138,2093,2048,2003,1959,1914,1871,					  // 20-29
//	1827,1784,1742,1700,1659,1618,1578,1538,1499,1461,					  // 30-39
//	1423,1386,1350,1314,1279,1245,1211,1179,1147,1115,					  // 40-49
//	1085,1055,1025,997,969,942,915,889,864,840,					          // 50-59
//	816,793,770,748,727,706,686,666,647,629,					          // 60-69
//	611,593,576,560,544,528,513,498,484,470,					          // 70-79
//	457,444,431,419,407,396,385,374,364,354,						      // 80-89
//	344,334,325,316,307,299,291,283,275,268,							  // 10-99
//	261,254,247,240,234,228,222,216,210,205,							  // 100-109 		  
//	199,194,189,184,180,175,171,166,162,158,							  // 110-119
//	154,150,147,143,139,136												  // 120-125
//}; 

//uc16   temperature_mid_neg[]=  //¸ºÎÂ¶ÈÇø¼äÎÂ¶È±í
//{
//	
//	3978,3970,3962,3953,3944,3934,3924,3913,3902,3890 ,					  //-40~-31
//	3878,3864,3851,3836,3821,3805,3789,3771,3753,3734,			          //-30~-21
//	3715,3694,3673,3651,3628,3604,3579,3553,3527,3499,					  //-20~-11
//	3471,3442,3411,3380,3348,3315,3282,3247,3211,3175  					  //-10~-1
//};

//struct Machine       MachineData;                   //Éè±¸³äÖµĞÅÏ¢£¬´óĞ¡30¸ö×Ö½Ú
//struct Machine_data  Machine_Setting_data;          //Éè±¸³ö³§ĞÅÏ¢£¬´óĞ¡134×Ö½Ú¡£

//struct adjust        adjust;    //ËÄÊ®¸ö×Ö½ÚµÄÒ»¸öÊı×é
//struct status        status;    //
//struct setting       setting;   //117¸ö×Ö½ÚµÄÒ»¸öÊı×é
//struct sw            SW_setup;  
//struct AC_Parameter  AC_Parameter; 


//struct Record              Daily_Record,Record_Read;      //ÈÕ±¨Êı¾İÊı±äÁ¿£¬´óĞ¡50¸ö×Ö½Ú¡£daily_RecordÄÚ´æÖĞµÄÈÕ±¨Êı¾İ±äÁ¿¡£
//struct Record_Run_Status   Record_Running;                //ÔËĞĞ¼ÇÂ¼Êı¾İ±äÁ¿£¬´óĞ¡16¸ö×Ö½Ú¡£
//struct Record_Index        Record_Daily_Index,Record_Running_Index;  //Õâ¸ö½á¹¹Ìå³¤¶È4×Ö½Ú¡£


//struct Card          M1Card;                        //Éè±¸³äÖµ¿¨ĞÅÏ¢£¬´óĞ¡28¸ö×Ö½Ú


//struct Time_Count    Time_Count;            //¸÷ÖÖÈí¼ş¶¨Ê±Æ÷¡£
//struct TimeStruct    Time;                  //Ò»¸öÖ»ÓĞÒ»¸ö³ÉÔ±µÄ½á¹¹ÌåÀàĞÍ¶¨Òå¡£°üº¬Ò»¸öU16µÄ±äÁ¿£¬Õâ¸ö±äÁ¿µÄÃû³ÆÊÇStarting_up_Open_Inverter_Delay£¬Æô¶¯Äæ±äÆ÷ÑÓÊ±¼ÆÊ±±äÁ¿¡£
//struct MODE_delay    Set_run_time;          //¶¨Ê±Éè±¸ÆôÍ£ÔËĞĞÄ£Ê½Ê±¼ä½ÚµãÊı×é£¬´óĞ¡25¸ö×Ö½Ú¡£

//Flag_struct  	Flag;
//Tm_struct     Tm;

////struct rtc_time systemtime;



//float u_v;	//Õâ´ÎÊä³öµÄÖµ
//float u1_v;	//ÉÏ´ÎÊä³öµÄÖµ
//float u2_v;	//ÉÏ´ÎÊä³öµÄÖµ
//float Kpv;    // 0.001;
//float Kiv;    // 0.0001;
////float Kp_v;	//±ÈÀıÏµÊı
////float Ki_v;	//»ı·ÖÏµÊı
//float ek_v;	  //µ±´ÎÎó²î
//float ek1_v;	//ÉÏÒ»´ÎÎó²î

//float u_i;	//Õâ´ÎÊä³öµÄÖµ
//float u1_i;	//ÉÏ´ÎÊä³öµÄÖµ
//float Kp_i;	//±ÈÀıÏµÊı
//float Ki_i;	//»ı·ÖÏµÊı
//float ek_i;	//µ±´ÎÎó²î
//float ek1_i;	//ÉÏÒ»´ÎÎó²î
////  float 	 Kp_i;  //0.01;
////  float 	 Ki_i; // 0.001;
////  float 	 Kp_v;  //0.001;
////  float 	 Ki_v; // 0.0001;

//int  VALUE_CONTROL;
//u8 Time_preset[6]={19,10,12,10,18,50};

////ËÙ¶Ï±£»¤È«¾Ö±äÁ¿  Ê±¼ä³£Êı10ms
////const float time_factor = 0.001;  //²ÉÑù¼ä¸ô1ms
////const float tc_oc_first = 0.01;   //²ÉÑùÖÜÆÚ10ms
//float i2T_VALUE[10];	  //I2T ±äÁ¿±í
//u8    i2T_VALUE_index;	//I2T ±äÁ¿±íÖ¸Õë
//float i2T_SUM;          // ËÙ¶Ï±£»¤ I2TÀÛ¼ÓºÍ
//float i2T_SUM_ref;      //¼ÆËãËÙ¶Ï±£»¤µÄãĞÖµ
//u8    flag_tc_oc_first; //ËÙ¶Ï±£»¤±êÖ¾Î» 0£ºÎŞËÙ¶Ï±£»¤£¬1£ºÓĞËÙ¶Ï±£»¤

////i2T ±£»¤È«¾Ö±äÁ¿  Ê±¼ä³£Êı5s
////const float time_factor = 0.001;  //²ÉÑù¼ä¸ô1ms
////const float  tc_oc_second = 5;      //²ÉÑùÖÜÆÚ5s

//float        e_i2t;                 //i2tÎó²î
//float        I2T_OC_second;         //i2tÖµ
//float        I2T_OC_second_ref;     //¼ÆËãI2T±£»¤ãĞÖµ
//u8           flag_I2T_OC_second;    //I2T±£»¤±êÖ¾Î» 0£ºÎŞI2T±£»¤£¬1£ºÓĞI2T±£»¤

////¹ıÁ÷´òàÃ±äÁ¿
//u8           hiccup_oc;             //´òàÃ¶¯×÷±êÖ¾Î»
//u8           hiccup_oc1;            //´òàÃ¶¯×÷±êÖ¾Î»		
//u32          hiccup_oc_count;       //´òàÃ¶¯×÷¼ÆÊ±Æ÷
//u8           hiccup_tick;           //´òàÃ½ÚÅÄÊı
//u8           hiccup_type;           //´òàÃÖÖÀà±êÖ¾Î»

unsigned char buf[256];
unsigned long gulSysClk1mS;

unsigned int   g_sysTick=0;
unsigned int   systickCount=0;

unsigned char g_rxbuf[MAXRecvBuf];
unsigned int 	g_wr=0,g_rd=0;
unsigned char g_rxbuf_tcp[MAXRecvBuf];
unsigned int 	g_wr_tcp=0,g_rd_tcp=0;
unsigned char com5_sended=0;

t_AdCali							g_Ads1247_Cali;
t_SaveNetIPCfg 				gs_SaveNetIPCfg;
t_WifiBleAtCmd				gs_WifiBleAtCmd;	

struct_com						Com;
struct_Voltage				VOLT;
struct_Temperature		Temp;
struct_ADC            ADC_Value;
Tm_struct							Tm;
CNT_struct            CNT;
DI_struct							DI;
DO_struct             DO;
Flag_struct           Flag;
calendar_struct       Calendar;

unsigned char	Do_Sta[8]={0};					//doçŠ¶æ€
unsigned char Sw_Sta[8]={0};					//æ‹¨ç ç›˜çŠ¶æ€
unsigned char Android_Sta=0;					//Androidç”µæºçŠ¶æ€
short	int			Adc_Data[4]={0};				//adé‡‡é›†åè½¬æ¢åçš„æ•°æ®
int						Ads1247_Value[8]={0};		//ads1247 8ä¸ªé€šé“çš„adæ•°æ® 
unsigned char Irq_Ads1247_Ready=0;		//ads1247è½¬æ¢å®Œæˆä¸­æ–­
float	Ads_1247_Fvalue[8]={0};						//float ç”µå‹æ•°æ® v

device_information_struct DevInfo={
	//             1         2  
	//   012345678901234567890123456789
	{6, "Owrely",},//COMPANY_TB
	{6, "Owrely",},//COMPANY_TB2
	{12,"Master-MCU_V1.0",},//HW_TB
	{12,"Master-MCU_V1.0",},//SW_TB
	{8, "14000000",},//SERIAL_NO_TB
	{7, "Master-MCU",},//PRO_NAME_TB
	1,//ID
};







